app/Controllers/Admin/Activities.php

    public function index()
    {
        return view('admin/activities/index', [
            'title' => 'Activites sportives',
            'activities' => db_connect()->table('ActiviteSportive')->orderBy('id_activite', 'DESC')->get()->getResultArray(),
---
SELECT *
FROM `ActiviteSportive`
ORDER BY `id_activite` DESC