app/Controllers/Admin/Auth.php

SELECT *
FROM `Client`
WHERE `email` = 'admin@regim.test'
AND `role` = 'admin'
---
    public function attemptLogin()
    {
        $email = trim((string) $this->request->getPost('email'));
        $password = (string) $this->request->getPost('password');
        $user = db_connect()->table('Client')->where('email', $email)->where('role', 'admin')->get()->getRowArray();