app/Controllers/Admin/Settings.php

    public function index()
    {
        return view('admin/settings/index', [
            'title' => 'Parametres',
            'settings' => db_connect()->table('ParametreGlobal')->orderBy('cle')->get()->getResultArray(),
---
SELECT *
FROM `ParametreGlobal`
ORDER BY `cle`